In [1]:
import pandas as pd
import numpy as np

In [2]:
data = { 'name':['Alice','Bob','charlie'],'age':[25,30,35]}
df =pd.DataFrame(data)

In [3]:
df['gender']='Male'

In [4]:
df.head()

      name  age gender
0    Alice   25   Male
1      Bob   30   Male
2  charlie   35   Male

In [5]:
df.loc[3] = ['Rob', np.nan, 'Male']

In [6]:
df.head()

      name   age gender
0    Alice  25.0   Male
1      Bob  30.0   Male
2  charlie  35.0   Male
3      Rob   NaN   Male

In [7]:
df.loc[4] = ['Jane', 24, 'Female']

In [8]:
df.loc[1, 'gender'] =  np.nan

In [9]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0     NaN
2  charlie  35.0    Male
3      Rob   NaN    Male
4     Jane  24.0  Female

In [10]:
df['age'].fillna(26,inplace=True)

In [11]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0     NaN
2  charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [12]:
df.gender.fillna('female',inplace= True)

In [13]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0  female
2  charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [14]:
df.dropna(inplace= True)

In [15]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0  female
2  charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [16]:
df.drop('gender' , axis = 1)

      name   age
0    Alice  25.0
1      Bob  30.0
2  charlie  35.0
3      Rob  26.0
4     Jane  24.0

In [17]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0  female
2  charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [18]:
df.reset_index().drop('index', axis=1)

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0  female
2  charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [19]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0  female
2  charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [20]:
df.reset_index(drop=True)

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0  female
2  charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [21]:
df.columns

Index(['name', 'age', 'gender'], dtype='object')

In [22]:
col_mapper= {'name':'Name', 'age':'Age', 'gender':'Gender'}

In [23]:
df.rename(columns=col_mapper)

      Name   Age  Gender
0    Alice  25.0    Male
1      Bob  30.0  female
2  charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [24]:
def double(x):
    return x *2

In [25]:
df['age'].apply(double)

0    50.0
1    60.0
2    70.0
3    52.0
4    48.0
Name: age, dtype: float64

In [26]:
df['age'].apply(lambda x: x*2)

0    50.0
1    60.0
2    70.0
3    52.0
4    48.0
Name: age, dtype: float64

In [27]:
df.head()

      name   age  gender
0    Alice  25.0    Male
1      Bob  30.0  female
2  charlie  35.0    Male
3      Rob  26.0    Male
4     Jane  24.0  Female

In [28]:
grouped_df = df.groupby('gender')

In [29]:
grouped_df

In [30]:
grouped_df.agg({"age" : "mean"})

              age
gender
Female  24.000000
Male    28.666667
female  30.000000